GopalSaraf/Practicals/PSDL/include/proc/pic16f1776.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 0015h
// bitfield definitions
PIR5_C5IF_POSN                           equ 0000h
PIR5_C5IF_POSITION                       equ 0000h
PIR5_C5IF_SIZE                           equ 0001h
PIR5_C5IF_LENGTH                         equ 0001h
PIR5_C5IF_MASK                           equ 0001h
PIR5_C6IF_POSN                           equ 0001h
PIR5_C6IF_POSITION                       equ 0001h
PIR5_C6IF_SIZE                           equ 0001h
PIR5_C6IF_LENGTH                         equ 0001h
PIR5_C6IF_MASK                           equ 0002h
PIR5_COG3IF_POSN                         equ 0004h
PIR5_COG3IF_POSITION                     equ 0004h
PIR5_COG3IF_SIZE                         equ 0001h
PIR5_COG3IF_LENGTH                       equ 0001h
PIR5_COG3IF_MASK                         equ 0010h
PIR5_CCP7IF_POSN                         equ 0006h
PIR5_CCP7IF_POSITION                     equ 0006h
PIR5_CCP7IF_SIZE                         equ 0001h
PIR5_CCP7IF_LENGTH                       equ 0001h
PIR5_CCP7IF_MASK                         equ 0040h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 0016h
// bitfield definitions
PIR6_PWM5IF_POSN                         equ 0000h
PIR6_PWM5IF_POSITION                     equ 0000h
PIR6_PWM5IF_SIZE                         equ 0001h
PIR6_PWM5IF_LENGTH                       equ 0001h
PIR6_PWM5IF_MASK                         equ 0001h
PIR6_PWM6IF_POSN                         equ 0001h
PIR6_PWM6IF_POSITION                     equ 0001h
PIR6_PWM6IF_SIZE                         equ 0001h
PIR6_PWM6IF_LENGTH                       equ 0001h
PIR6_PWM6IF_MASK                         equ 0002h
PIR6_PWM11IF_POSN                        equ 0002h
PIR6_PWM11IF_POSITION                    equ 0002h
PIR6_PWM11IF_SIZE                        equ 0001h
PIR6_PWM11IF_LENGTH                      equ 0001h
PIR6_PWM11IF_MASK                        equ 0004h

// Register: TMR0
#define TMR0 TMR0
TMR0                                     equ 0017h
// bitfield definitions
TMR0_TMR0_POSN                           equ 0000h
TMR0_TMR0_POSITION                       equ 0000h
TMR0_TMR0_SIZE                           equ 0008h
TMR0_TMR0_LENGTH                         equ 0008h
TMR0_TMR0_MASK                           equ 00FFh

// Register: TMR1L
#define TMR1L TMR1L
TMR1L                                    equ 0018h
// bitfield definitions
TMR1L_TMR_POSN                           equ 0000h
TMR1L_TMR_POSITION                       equ 0000h
TMR1L_TMR_SIZE                           equ 0008h
TMR1L_TMR_LENGTH                         equ 0008h
TMR1L_TMR_MASK                           equ 00FFh

// Register: TMR1H
#define TMR1H TMR1H
TMR1H                                    equ 0019h
// bitfield definitions
TMR1H_TMR_POSN                           equ 0000h
TMR1H_TMR_POSITION                       equ 0000h
TMR1H_TMR_SIZE                           equ 0008h
TMR1H_TMR_LENGTH                         equ 0008h
TMR1H_TMR_MASK                           equ 00FFh

// Register: T1CON
#define T1CON T1CON
T1CON                                    equ 001Ah
// bitfield definitions
T1CON_ON_POSN                            equ 0000h
T1CON_ON_POSITION                        equ 0000h
T1CON_ON_SIZE                            equ 0001h
T1CON_ON_LENGTH                          equ 0001h
T1CON_ON_MASK                            equ 0001h
T1CON_nSYNC_POSN                         equ 0002h
T1CON_nSYNC_POSITION                     equ 0002h
T1CON_nSYNC_SIZE                         equ 0001h
T1CON_nSYNC_LENGTH                       equ 0001h
T1CON_nSYNC_MASK                         equ 0004h
T1CON_OSCEN_POSN                         equ 0003h
T1CON_OSCEN_POSITION                     equ 0003h
T1CON_OSCEN_SIZE                         equ 0001h
T1CON_OSCEN_LENGTH                       equ 0001h
T1CON_OSCEN_MASK                         equ 0008h
T1CON_CKPS_POSN                          equ 0004h
T1CON_CKPS_POSITION                      equ 0004h
T1CON_CKPS_SIZE                          equ 0002h
T1CON_CKPS_LENGTH                        equ 0002h
T1CON_CKPS_MASK                          equ 0030h
T1CON_CS_POSN                            equ 0006h
T1CON_CS_POSITION                        equ 0006h
T1CON_CS_SIZE                            equ 0002h
T1CON_CS_LENGTH                          equ 0002h
T1CON_CS_MASK                            equ 00C0h
T1CON_TMRON_POSN                         equ 0000h
T1CON_TMRON_POSITION                     equ 0000h
T1CON_TMRON_SIZE                         equ 0001h
T1CON_TMRON_LENGTH                       equ 0001h
T1CON_TMRON_MASK                         equ 0001h
T1CON_SYNC_POSN                          equ 0002h
T1CON_SYNC_POSITION                      equ 0002h
T1CON_SYNC_SIZE                          equ 0001h
T1CON_SYNC_LENGTH                        equ 0001h
T1CON_SYNC_MASK                          equ 0004h
T1CON_SOSCEN_POSN                        equ 0003h
T1CON_SOSCEN_POSITION                    equ 0003h
T1CON_SOSCEN_SIZE                        equ 0001h
T1CON_SOSCEN_LENGTH                      equ 0001h
T1CON_SOSCEN_MASK                        equ 0008h
T1CON_CKPS0_POSN                         equ 0004h
T1CON_CKPS0_POSITION                     equ 0004h
T1CON_CKPS0_SIZE                         equ 0001h
T1CON_CKPS0_LENGTH                       equ 0001h
T1CON_CKPS0_MASK                         equ 0010h
T1CON_CKPS1_POSN                         equ 0005h
T1CON_CKPS1_POSITION                     equ 0005h
T1CON_CKPS1_SIZE                         equ 0001h
T1CON_CKPS1_LENGTH                       equ 0001h
T1CON_CKPS1_MASK                         equ 0020h
T1CON_CS0_POSN                           equ 0006h
T1CON_CS0_POSITION                       equ 0006h
T1CON_CS0_SIZE                           equ 0001h
T1CON_CS0_LENGTH                         equ 0001h
T1CON_CS0_MASK                           equ 0040h
T1CON_CS1_POSN                           equ 0007h
T1CON_CS1_POSITION                       equ 0007h
T1CON_CS1_SIZE                           equ 0001h
T1CON_CS1_LENGTH                         equ 0001h
T1CON_CS1_MASK                           equ 0080h
T1CON_TMR1ON_POSN                        equ 0000h
T1CON_TMR1ON_POSITION                    equ 0000h
T1CON_TMR1ON_SIZE                        equ 0001h
T1CON_TMR1ON_LENGTH                      equ 0001h
T1CON_TMR1ON_MASK                        equ 0001h
T1CON_nT1SYNC_POSN                       equ 0002h
T1CON_nT1SYNC_POSITION                   equ 0002h
T1CON_nT1SYNC_SIZE                       equ 0001h
T1CON_nT1SYNC_LENGTH                     equ 0001h
T1CON_nT1SYNC_MASK                       equ 0004h
T1CON_T1OSCEN_POSN                       equ 0003h
T1CON_T1OSCEN_POSITION                   equ 0003h
T1CON_T1OSCEN_SIZE                       equ 0001h
T1CON_T1OSCEN_LENGTH                     equ 0001h
T1CON_T1OSCEN_MASK                       equ 0008h
T1CON_T1CS0_POSN                         equ 0006h
T1CON_T1CS0_POSITION                     equ 0006h
T1CON_T1CS0_SIZE                         equ 0001h
T1CON_T1CS0_LENGTH                       equ 0001h
T1CON_T1CS0_MASK                         equ 0040h
T1CON_T1CS1_POSN                         equ 0007h
T1CON_T1CS1_POSITION                     equ 0007h
T1CON_T1CS1_SIZE                         equ 0001h
T1CON_T1CS1_LENGTH                       equ 0001h
T1CON_T1CS1_MASK                         equ 0080h
T1CON_T1ON_POSN                          equ 0000h
T1CON_T1ON_POSITION                      equ 0000h
T1CON_T1ON_SIZE                          equ 0001h
T1CON_T1ON_LENGTH                        equ 0001h
T1CON_T1ON_MASK                          equ 0001h
T1CON_T1CKPS0_POSN                       equ 0004h
T1CON_T1CKPS0_POSITION                   equ 0004h
T1CON_T1CKPS0_SIZE                       equ 0001h
T1CON_T1CKPS0_LENGTH                     equ 0001h
T1CON_T1CKPS0_MASK                       equ 0010h
T1CON_T1CKPS1_POSN                       equ 0005h
T1CON_T1CKPS1_POSITION                   equ 0005h
T1CON_T1CKPS1_SIZE                       equ 0001h
T1CON_T1CKPS1_LENGTH                     equ 0001h
T1CON_T1CKPS1_MASK                       equ 0020h
T1CON_TMR1CS0_POSN                       equ 0006h
T1CON_TMR1CS0_POSITION                   equ 0006h
T1CON_TMR1CS0_SIZE                       equ 0001h
T1CON_TMR1CS0_LENGTH                     equ 0001h
T1CON_TMR1CS0_MASK                       equ 0040h
T1CON_TMR1CS1_POSN                       equ 0007h
T1CON_TMR1CS1_POSITION                   equ 0007h
T1CON_TMR1CS1_SIZE                       equ 0001h
T1CON_TMR1CS1_LENGTH                     equ 0001h
T1CON_TMR1CS1_MASK                       equ 0080h

// Register: T1GCON
#define T1GCON T1GCON
T1GCON                                   equ 001Bh
// bitfield definitions
T1GCON_GSS_POSN                          equ 0000h
T1GCON_GSS_POSITION                      equ 0000h
T1GCON_GSS_SIZE                          equ 0002h
T1GCON_GSS_LENGTH                        equ 0002h
T1GCON_GSS_MASK                          equ 0003h
T1GCON_GVAL_POSN                         equ 0002h
T1GCON_GVAL_POSITION                     equ 0002h
T1GCON_GVAL_SIZE                         equ 0001h
T1GCON_GVAL_LENGTH                       equ 0001h
T1GCON_GVAL_MASK                         equ 0004h
T1GCON_GGO_nDONE_POSN                    equ 0003h
T1GCON_GGO_nDONE_POSITION                equ 0003h
T1GCON_GGO_nDONE_SIZE                    equ 0001h
T1GCON_GGO_nDONE_LENGTH                  equ 0001h
T1GCON_GGO_nDONE_MASK                    equ 0008h
T1GCON_GSPM_POSN                         equ 0004h
T1GCON_GSPM_POSITION                     equ 0004h
T1GCON_GSPM_SIZE                         equ 0001h
T1GCON_GSPM_LENGTH                       equ 0001h
T1GCON_GSPM_MASK                         equ 0010h
T1GCON_GTM_POSN                          equ 0005h
T1GCON_GTM_POSITION                      equ 0005h
T1GCON_GTM_SIZE                          equ 0001h
T1GCON_GTM_LENGTH                        equ 0001h
T1GCON_GTM_MASK                          equ 0020h
T1GCON_GPOL_POSN                         equ 0006h
T1GCON_GPOL_POSITION                     equ 0006h
T1GCON_GPOL_SIZE                         equ 0001h
T1GCON_GPOL_LENGTH                       equ 0001h
T1GCON_GPOL_MASK                         equ 0040h
T1GCON_GE_POSN                           equ 0007h
T1GCON_GE_POSITION                       equ 0007h
T1GCON_GE_SIZE                           equ 0001h
T1GCON_GE_LENGTH                         equ 0001h
T1GCON_GE_MASK                           equ 0080h
T1GCON_GSS0_POSN                         equ 0000h
T1GCON_GSS0_POSITION                     equ 0000h
T1GCON_GSS0_SIZE                         equ 0001h
T1GCON_GSS0_LENGTH                       equ 0001h
T1GCON_GSS0_MASK                         equ 0001h
T1GCON_GSS1_POSN                         equ 0001h
T1GCON_GSS1_POSITION                     equ 0001h
T1GCON_GSS1_SIZE                         equ 0001h
T1GCON_GSS1_LENGTH                       equ 0001h
T1GCON_GSS1_MASK                         equ 0002h
T1GCON_T1GE_POSN                         equ 0007h
T1GCON_T1GE_POSITION                     equ 0007h
T1GCON_T1GE_SIZE                         equ 0001h
T1GCON_T1GE_LENGTH                       equ 0001h
T1GCON_T1GE_MASK                         equ 0080h
T1GCON_T1GVAL_POSN                       equ 0002h
T1GCON_T1GVAL_POSITION                   equ 0002h
T1GCON_T1GVAL_SIZE                       equ 0001h
T1GCON_T1GVAL_LENGTH                     equ 0001h
T1GCON_T1GVAL_MASK                       equ 0004h
T1GCON_T1GGO_nDONE_POSN                  equ 0003h
T1GCON_T1GGO_nDONE_POSITION              equ 0003h
T1GCON_T1GGO_nDONE_SIZE                  equ 0001h
T1GCON_T1GGO_nDONE_LENGTH                equ 0001h
T1GCON_T1GGO_nDONE_MASK                  equ 0008h
T1GCON_T1GSPM_POSN                       equ 0004h
T1GCON_T1GSPM_POSITION                   equ 0004h
T1GCON_T1GSPM_SIZE                       equ 0001h
T1GCON_T1GSPM_LENGTH                     equ 0001h
T1GCON_T1GSPM_MASK                       equ 0010h
T1GCON_T1GTM_POSN                        equ 0005h
T1GCON_T1GTM_POSITION                    equ 0005h
T1GCON_T1GTM_SIZE                        equ 0001h
T1GCON_T1GTM_LENGTH                      equ 0001h
T1GCON_T1GTM_MASK                        equ 0020h
T1GCON_T1GPOL_POSN                       equ 0006h
T1GCON_T1GPOL_POSITION                   equ 0006h
T1GCON_T1GPOL_SIZE                       equ 0001h
T1GCON_T1GPOL_LENGTH                     equ 0001h
T1GCON_T1GPOL_MASK                       equ 0040h
T1GCON_TMR1GE_POSN                       equ 0007h
T1GCON_TMR1GE_POSITION                   equ 0007h
T1GCON_TMR1GE_SIZE                       equ 0001h
T1GCON_TMR1GE_LENGTH                     equ 0001h
T1GCON_TMR1GE_MASK                       equ 0080h
T1GCON_T1GSS0_POSN                       equ 0000h
T1GCON_T1GSS0_POSITION                   equ 0000h
T1GCON_T1GSS0_SIZE                       equ 0001h
T1GCON_T1GSS0_LENGTH                     equ 0001h
T1GCON_T1GSS0_MASK                       equ 0001h
T1GCON_T1GSS1_POSN                       equ 0001h
T1GCON_T1GSS1_POSITION                   equ 0001h
T1GCON_T1GSS1_SIZE                       equ 0001h
T1GCON_T1GSS1_LENGTH                     equ 0001h
T1GCON_T1GSS1_MASK                       equ 0002h

// Register: TMR3L
#define TMR3L TMR3L
TMR3L                                    equ 001Ch
// bitfield definitions
TMR3L_TMR_POSN                           equ 0000h
TMR3L_TMR_POSITION                       equ 0000h
TMR3L_TMR_SIZE                           equ 0008h
TMR3L_TMR_LENGTH                         equ 0008h
TMR3L_TMR_MASK                           equ 00FFh

