GopalSaraf/Practicals/PSDL/include/proc/pic16f1776.inc
// Register: PWM5OFCON
#define PWM5OFCON PWM5OFCON
PWM5OFCON                                equ 0DA0h
// bitfield definitions
PWM5OFCON_OFS_POSN                       equ 0000h
PWM5OFCON_OFS_POSITION                   equ 0000h
PWM5OFCON_OFS_SIZE                       equ 0002h
PWM5OFCON_OFS_LENGTH                     equ 0002h
PWM5OFCON_OFS_MASK                       equ 0003h
PWM5OFCON_OFO_POSN                       equ 0004h
PWM5OFCON_OFO_POSITION                   equ 0004h
PWM5OFCON_OFO_SIZE                       equ 0001h
PWM5OFCON_OFO_LENGTH                     equ 0001h
PWM5OFCON_OFO_MASK                       equ 0010h
PWM5OFCON_OFM_POSN                       equ 0005h
PWM5OFCON_OFM_POSITION                   equ 0005h
PWM5OFCON_OFM_SIZE                       equ 0002h
PWM5OFCON_OFM_LENGTH                     equ 0002h
PWM5OFCON_OFM_MASK                       equ 0060h
PWM5OFCON_PWM5OFS0_POSN                  equ 0000h
PWM5OFCON_PWM5OFS0_POSITION              equ 0000h
PWM5OFCON_PWM5OFS0_SIZE                  equ 0001h
PWM5OFCON_PWM5OFS0_LENGTH                equ 0001h
PWM5OFCON_PWM5OFS0_MASK                  equ 0001h
PWM5OFCON_PWM5OFS1_POSN                  equ 0001h
PWM5OFCON_PWM5OFS1_POSITION              equ 0001h
PWM5OFCON_PWM5OFS1_SIZE                  equ 0001h
PWM5OFCON_PWM5OFS1_LENGTH                equ 0001h
PWM5OFCON_PWM5OFS1_MASK                  equ 0002h
PWM5OFCON_PWM5OFM0_POSN                  equ 0005h
PWM5OFCON_PWM5OFM0_POSITION              equ 0005h
PWM5OFCON_PWM5OFM0_SIZE                  equ 0001h
PWM5OFCON_PWM5OFM0_LENGTH                equ 0001h
PWM5OFCON_PWM5OFM0_MASK                  equ 0020h
PWM5OFCON_PWM5OFM1_POSN                  equ 0006h
PWM5OFCON_PWM5OFM1_POSITION              equ 0006h
PWM5OFCON_PWM5OFM1_SIZE                  equ 0001h
PWM5OFCON_PWM5OFM1_LENGTH                equ 0001h
PWM5OFCON_PWM5OFM1_MASK                  equ 0040h
PWM5OFCON_PWM5OFS_POSN                   equ 0000h
PWM5OFCON_PWM5OFS_POSITION               equ 0000h
PWM5OFCON_PWM5OFS_SIZE                   equ 0002h
PWM5OFCON_PWM5OFS_LENGTH                 equ 0002h
PWM5OFCON_PWM5OFS_MASK                   equ 0003h
PWM5OFCON_PWM5OFMC_POSN                  equ 0004h
PWM5OFCON_PWM5OFMC_POSITION              equ 0004h
PWM5OFCON_PWM5OFMC_SIZE                  equ 0001h
PWM5OFCON_PWM5OFMC_LENGTH                equ 0001h
PWM5OFCON_PWM5OFMC_MASK                  equ 0010h
PWM5OFCON_PWM5OFM_POSN                   equ 0005h
PWM5OFCON_PWM5OFM_POSITION               equ 0005h
PWM5OFCON_PWM5OFM_SIZE                   equ 0002h
PWM5OFCON_PWM5OFM_LENGTH                 equ 0002h
PWM5OFCON_PWM5OFM_MASK                   equ 0060h
PWM5OFCON_OFS0_POSN                      equ 0000h
PWM5OFCON_OFS0_POSITION                  equ 0000h
PWM5OFCON_OFS0_SIZE                      equ 0001h
PWM5OFCON_OFS0_LENGTH                    equ 0001h
PWM5OFCON_OFS0_MASK                      equ 0001h
PWM5OFCON_OFS1_POSN                      equ 0001h
PWM5OFCON_OFS1_POSITION                  equ 0001h
PWM5OFCON_OFS1_SIZE                      equ 0001h
PWM5OFCON_OFS1_LENGTH                    equ 0001h
PWM5OFCON_OFS1_MASK                      equ 0002h
PWM5OFCON_OFM0_POSN                      equ 0005h
PWM5OFCON_OFM0_POSITION                  equ 0005h
PWM5OFCON_OFM0_SIZE                      equ 0001h
PWM5OFCON_OFM0_LENGTH                    equ 0001h
PWM5OFCON_OFM0_MASK                      equ 0020h
PWM5OFCON_OFM1_POSN                      equ 0006h
PWM5OFCON_OFM1_POSITION                  equ 0006h
PWM5OFCON_OFM1_SIZE                      equ 0001h
PWM5OFCON_OFM1_LENGTH                    equ 0001h
PWM5OFCON_OFM1_MASK                      equ 0040h

// Register: PWM6PHL
#define PWM6PHL PWM6PHL
PWM6PHL                                  equ 0DA1h
// bitfield definitions
PWM6PHL_PH_POSN                          equ 0000h
PWM6PHL_PH_POSITION                      equ 0000h
PWM6PHL_PH_SIZE                          equ 0008h
PWM6PHL_PH_LENGTH                        equ 0008h
PWM6PHL_PH_MASK                          equ 00FFh
PWM6PHL_PWM6PHL0_POSN                    equ 0000h
PWM6PHL_PWM6PHL0_POSITION                equ 0000h
PWM6PHL_PWM6PHL0_SIZE                    equ 0001h
PWM6PHL_PWM6PHL0_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL0_MASK                    equ 0001h
PWM6PHL_PWM6PHL1_POSN                    equ 0001h
PWM6PHL_PWM6PHL1_POSITION                equ 0001h
PWM6PHL_PWM6PHL1_SIZE                    equ 0001h
PWM6PHL_PWM6PHL1_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL1_MASK                    equ 0002h
PWM6PHL_PWM6PHL2_POSN                    equ 0002h
PWM6PHL_PWM6PHL2_POSITION                equ 0002h
PWM6PHL_PWM6PHL2_SIZE                    equ 0001h
PWM6PHL_PWM6PHL2_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL2_MASK                    equ 0004h
PWM6PHL_PWM6PHL3_POSN                    equ 0003h
PWM6PHL_PWM6PHL3_POSITION                equ 0003h
PWM6PHL_PWM6PHL3_SIZE                    equ 0001h
PWM6PHL_PWM6PHL3_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL3_MASK                    equ 0008h
PWM6PHL_PWM6PHL4_POSN                    equ 0004h
PWM6PHL_PWM6PHL4_POSITION                equ 0004h
PWM6PHL_PWM6PHL4_SIZE                    equ 0001h
PWM6PHL_PWM6PHL4_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL4_MASK                    equ 0010h
PWM6PHL_PWM6PHL5_POSN                    equ 0005h
PWM6PHL_PWM6PHL5_POSITION                equ 0005h
PWM6PHL_PWM6PHL5_SIZE                    equ 0001h
PWM6PHL_PWM6PHL5_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL5_MASK                    equ 0020h
PWM6PHL_PWM6PHL6_POSN                    equ 0006h
PWM6PHL_PWM6PHL6_POSITION                equ 0006h
PWM6PHL_PWM6PHL6_SIZE                    equ 0001h
PWM6PHL_PWM6PHL6_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL6_MASK                    equ 0040h
PWM6PHL_PWM6PHL7_POSN                    equ 0007h
PWM6PHL_PWM6PHL7_POSITION                equ 0007h
PWM6PHL_PWM6PHL7_SIZE                    equ 0001h
PWM6PHL_PWM6PHL7_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL7_MASK                    equ 0080h
PWM6PHL_PWM6PHL_POSN                     equ 0000h
PWM6PHL_PWM6PHL_POSITION                 equ 0000h
PWM6PHL_PWM6PHL_SIZE                     equ 0008h
PWM6PHL_PWM6PHL_LENGTH                   equ 0008h
PWM6PHL_PWM6PHL_MASK                     equ 00FFh

