GopalSaraf/Practicals/PSDL/include/proc/pic16f1776.inc
// Register: PWM11TMRL
#define PWM11TMRL PWM11TMRL
PWM11TMRL                                equ 0DB9h
// bitfield definitions
PWM11TMRL_TMR_POSN                       equ 0000h
PWM11TMRL_TMR_POSITION                   equ 0000h
PWM11TMRL_TMR_SIZE                       equ 0008h
PWM11TMRL_TMR_LENGTH                     equ 0008h
PWM11TMRL_TMR_MASK                       equ 00FFh
PWM11TMRL_PWM11TMRL0_POSN                equ 0000h
PWM11TMRL_PWM11TMRL0_POSITION            equ 0000h
PWM11TMRL_PWM11TMRL0_SIZE                equ 0001h
PWM11TMRL_PWM11TMRL0_LENGTH              equ 0001h
PWM11TMRL_PWM11TMRL0_MASK                equ 0001h
PWM11TMRL_PWM11TMRL1_POSN                equ 0001h
PWM11TMRL_PWM11TMRL1_POSITION            equ 0001h
PWM11TMRL_PWM11TMRL1_SIZE                equ 0001h
PWM11TMRL_PWM11TMRL1_LENGTH              equ 0001h
PWM11TMRL_PWM11TMRL1_MASK                equ 0002h
PWM11TMRL_PWM11TMRL2_POSN                equ 0002h
PWM11TMRL_PWM11TMRL2_POSITION            equ 0002h
PWM11TMRL_PWM11TMRL2_SIZE                equ 0001h
PWM11TMRL_PWM11TMRL2_LENGTH              equ 0001h
PWM11TMRL_PWM11TMRL2_MASK                equ 0004h
PWM11TMRL_PWM11TMRL3_POSN                equ 0003h
PWM11TMRL_PWM11TMRL3_POSITION            equ 0003h
PWM11TMRL_PWM11TMRL3_SIZE                equ 0001h
PWM11TMRL_PWM11TMRL3_LENGTH              equ 0001h
PWM11TMRL_PWM11TMRL3_MASK                equ 0008h
PWM11TMRL_PWM11TMRL4_POSN                equ 0004h
PWM11TMRL_PWM11TMRL4_POSITION            equ 0004h
PWM11TMRL_PWM11TMRL4_SIZE                equ 0001h
PWM11TMRL_PWM11TMRL4_LENGTH              equ 0001h
PWM11TMRL_PWM11TMRL4_MASK                equ 0010h
PWM11TMRL_PWM11TMRL5_POSN                equ 0005h
PWM11TMRL_PWM11TMRL5_POSITION            equ 0005h
PWM11TMRL_PWM11TMRL5_SIZE                equ 0001h
PWM11TMRL_PWM11TMRL5_LENGTH              equ 0001h
PWM11TMRL_PWM11TMRL5_MASK                equ 0020h
PWM11TMRL_PWM11TMRL6_POSN                equ 0006h
PWM11TMRL_PWM11TMRL6_POSITION            equ 0006h
PWM11TMRL_PWM11TMRL6_SIZE                equ 0001h
PWM11TMRL_PWM11TMRL6_LENGTH              equ 0001h
PWM11TMRL_PWM11TMRL6_MASK                equ 0040h
PWM11TMRL_PWM11TMRL7_POSN                equ 0007h
PWM11TMRL_PWM11TMRL7_POSITION            equ 0007h
PWM11TMRL_PWM11TMRL7_SIZE                equ 0001h
PWM11TMRL_PWM11TMRL7_LENGTH              equ 0001h
PWM11TMRL_PWM11TMRL7_MASK                equ 0080h
PWM11TMRL_PWM11TMRL_POSN                 equ 0000h
PWM11TMRL_PWM11TMRL_POSITION             equ 0000h
PWM11TMRL_PWM11TMRL_SIZE                 equ 0008h
PWM11TMRL_PWM11TMRL_LENGTH               equ 0008h
PWM11TMRL_PWM11TMRL_MASK                 equ 00FFh

// Register: PWM11TMRH
#define PWM11TMRH PWM11TMRH
PWM11TMRH                                equ 0DBAh
// bitfield definitions
PWM11TMRH_TMR_POSN                       equ 0000h
PWM11TMRH_TMR_POSITION                   equ 0000h
PWM11TMRH_TMR_SIZE                       equ 0008h
PWM11TMRH_TMR_LENGTH                     equ 0008h
PWM11TMRH_TMR_MASK                       equ 00FFh
PWM11TMRH_PWM11TMRH0_POSN                equ 0000h
PWM11TMRH_PWM11TMRH0_POSITION            equ 0000h
PWM11TMRH_PWM11TMRH0_SIZE                equ 0001h
PWM11TMRH_PWM11TMRH0_LENGTH              equ 0001h
PWM11TMRH_PWM11TMRH0_MASK                equ 0001h
PWM11TMRH_PWM11TMRH1_POSN                equ 0001h
PWM11TMRH_PWM11TMRH1_POSITION            equ 0001h
PWM11TMRH_PWM11TMRH1_SIZE                equ 0001h
PWM11TMRH_PWM11TMRH1_LENGTH              equ 0001h
PWM11TMRH_PWM11TMRH1_MASK                equ 0002h
PWM11TMRH_PWM11TMRH2_POSN                equ 0002h
PWM11TMRH_PWM11TMRH2_POSITION            equ 0002h
PWM11TMRH_PWM11TMRH2_SIZE                equ 0001h
PWM11TMRH_PWM11TMRH2_LENGTH              equ 0001h
PWM11TMRH_PWM11TMRH2_MASK                equ 0004h
PWM11TMRH_PWM11TMRH3_POSN                equ 0003h
PWM11TMRH_PWM11TMRH3_POSITION            equ 0003h
PWM11TMRH_PWM11TMRH3_SIZE                equ 0001h
PWM11TMRH_PWM11TMRH3_LENGTH              equ 0001h
PWM11TMRH_PWM11TMRH3_MASK                equ 0008h
PWM11TMRH_PWM11TMRH4_POSN                equ 0004h
PWM11TMRH_PWM11TMRH4_POSITION            equ 0004h
PWM11TMRH_PWM11TMRH4_SIZE                equ 0001h
PWM11TMRH_PWM11TMRH4_LENGTH              equ 0001h
PWM11TMRH_PWM11TMRH4_MASK                equ 0010h
PWM11TMRH_PWM11TMRH5_POSN                equ 0005h
PWM11TMRH_PWM11TMRH5_POSITION            equ 0005h
PWM11TMRH_PWM11TMRH5_SIZE                equ 0001h
PWM11TMRH_PWM11TMRH5_LENGTH              equ 0001h
PWM11TMRH_PWM11TMRH5_MASK                equ 0020h
PWM11TMRH_PWM11TMRH6_POSN                equ 0006h
PWM11TMRH_PWM11TMRH6_POSITION            equ 0006h
PWM11TMRH_PWM11TMRH6_SIZE                equ 0001h
PWM11TMRH_PWM11TMRH6_LENGTH              equ 0001h
PWM11TMRH_PWM11TMRH6_MASK                equ 0040h
PWM11TMRH_PWM11TMRH7_POSN                equ 0007h
PWM11TMRH_PWM11TMRH7_POSITION            equ 0007h
PWM11TMRH_PWM11TMRH7_SIZE                equ 0001h
PWM11TMRH_PWM11TMRH7_LENGTH              equ 0001h
PWM11TMRH_PWM11TMRH7_MASK                equ 0080h
PWM11TMRH_PWM11TMRH_POSN                 equ 0000h
PWM11TMRH_PWM11TMRH_POSITION             equ 0000h
PWM11TMRH_PWM11TMRH_SIZE                 equ 0008h
PWM11TMRH_PWM11TMRH_LENGTH               equ 0008h
PWM11TMRH_PWM11TMRH_MASK                 equ 00FFh

// Register: PWM11CON
#define PWM11CON PWM11CON
PWM11CON                                 equ 0DBBh
// bitfield definitions
PWM11CON_MODE_POSN                       equ 0002h
PWM11CON_MODE_POSITION                   equ 0002h
PWM11CON_MODE_SIZE                       equ 0002h
PWM11CON_MODE_LENGTH                     equ 0002h
PWM11CON_MODE_MASK                       equ 000Ch
PWM11CON_POL_POSN                        equ 0004h
PWM11CON_POL_POSITION                    equ 0004h
PWM11CON_POL_SIZE                        equ 0001h
PWM11CON_POL_LENGTH                      equ 0001h
PWM11CON_POL_MASK                        equ 0010h
PWM11CON_OUT_POSN                        equ 0005h
PWM11CON_OUT_POSITION                    equ 0005h
PWM11CON_OUT_SIZE                        equ 0001h
PWM11CON_OUT_LENGTH                      equ 0001h
PWM11CON_OUT_MASK                        equ 0020h
PWM11CON_EN_POSN                         equ 0007h
PWM11CON_EN_POSITION                     equ 0007h
PWM11CON_EN_SIZE                         equ 0001h
PWM11CON_EN_LENGTH                       equ 0001h
PWM11CON_EN_MASK                         equ 0080h
PWM11CON_PWM11MODE0_POSN                 equ 0002h
PWM11CON_PWM11MODE0_POSITION             equ 0002h
PWM11CON_PWM11MODE0_SIZE                 equ 0001h
PWM11CON_PWM11MODE0_LENGTH               equ 0001h
PWM11CON_PWM11MODE0_MASK                 equ 0004h
PWM11CON_PWM11MODE1_POSN                 equ 0003h
PWM11CON_PWM11MODE1_POSITION             equ 0003h
PWM11CON_PWM11MODE1_SIZE                 equ 0001h
PWM11CON_PWM11MODE1_LENGTH               equ 0001h
PWM11CON_PWM11MODE1_MASK                 equ 0008h
PWM11CON_PWM11MODE_POSN                  equ 0002h
PWM11CON_PWM11MODE_POSITION              equ 0002h
PWM11CON_PWM11MODE_SIZE                  equ 0002h
PWM11CON_PWM11MODE_LENGTH                equ 0002h
PWM11CON_PWM11MODE_MASK                  equ 000Ch
PWM11CON_PWM11POL_POSN                   equ 0004h
PWM11CON_PWM11POL_POSITION               equ 0004h
PWM11CON_PWM11POL_SIZE                   equ 0001h
PWM11CON_PWM11POL_LENGTH                 equ 0001h
PWM11CON_PWM11POL_MASK                   equ 0010h
PWM11CON_PWM11OUT_POSN                   equ 0005h
PWM11CON_PWM11OUT_POSITION               equ 0005h
PWM11CON_PWM11OUT_SIZE                   equ 0001h
PWM11CON_PWM11OUT_LENGTH                 equ 0001h
PWM11CON_PWM11OUT_MASK                   equ 0020h
PWM11CON_PWM11EN_POSN                    equ 0007h
PWM11CON_PWM11EN_POSITION                equ 0007h
PWM11CON_PWM11EN_SIZE                    equ 0001h
PWM11CON_PWM11EN_LENGTH                  equ 0001h
PWM11CON_PWM11EN_MASK                    equ 0080h
PWM11CON_MODE0_POSN                      equ 0002h
PWM11CON_MODE0_POSITION                  equ 0002h
PWM11CON_MODE0_SIZE                      equ 0001h
PWM11CON_MODE0_LENGTH                    equ 0001h
PWM11CON_MODE0_MASK                      equ 0004h
PWM11CON_MODE1_POSN                      equ 0003h
PWM11CON_MODE1_POSITION                  equ 0003h
PWM11CON_MODE1_SIZE                      equ 0001h
PWM11CON_MODE1_LENGTH                    equ 0001h
PWM11CON_MODE1_MASK                      equ 0008h

// Register: PWM11INTE
#define PWM11INTE PWM11INTE
PWM11INTE                                equ 0DBCh
// bitfield definitions
PWM11INTE_PRIE_POSN                      equ 0000h
PWM11INTE_PRIE_POSITION                  equ 0000h
PWM11INTE_PRIE_SIZE                      equ 0001h
PWM11INTE_PRIE_LENGTH                    equ 0001h
PWM11INTE_PRIE_MASK                      equ 0001h
PWM11INTE_DCIE_POSN                      equ 0001h
PWM11INTE_DCIE_POSITION                  equ 0001h
PWM11INTE_DCIE_SIZE                      equ 0001h
PWM11INTE_DCIE_LENGTH                    equ 0001h
PWM11INTE_DCIE_MASK                      equ 0002h
PWM11INTE_PHIE_POSN                      equ 0002h
PWM11INTE_PHIE_POSITION                  equ 0002h
PWM11INTE_PHIE_SIZE                      equ 0001h
PWM11INTE_PHIE_LENGTH                    equ 0001h
PWM11INTE_PHIE_MASK                      equ 0004h
PWM11INTE_OFIE_POSN                      equ 0003h
PWM11INTE_OFIE_POSITION                  equ 0003h
PWM11INTE_OFIE_SIZE                      equ 0001h
PWM11INTE_OFIE_LENGTH                    equ 0001h
PWM11INTE_OFIE_MASK                      equ 0008h
PWM11INTE_PWM11PRIE_POSN                 equ 0000h
PWM11INTE_PWM11PRIE_POSITION             equ 0000h
PWM11INTE_PWM11PRIE_SIZE                 equ 0001h
PWM11INTE_PWM11PRIE_LENGTH               equ 0001h
PWM11INTE_PWM11PRIE_MASK                 equ 0001h
PWM11INTE_PWM11DCIE_POSN                 equ 0001h
PWM11INTE_PWM11DCIE_POSITION             equ 0001h
PWM11INTE_PWM11DCIE_SIZE                 equ 0001h
PWM11INTE_PWM11DCIE_LENGTH               equ 0001h
PWM11INTE_PWM11DCIE_MASK                 equ 0002h
PWM11INTE_PWM11PHIE_POSN                 equ 0002h
PWM11INTE_PWM11PHIE_POSITION             equ 0002h
PWM11INTE_PWM11PHIE_SIZE                 equ 0001h
PWM11INTE_PWM11PHIE_LENGTH               equ 0001h
PWM11INTE_PWM11PHIE_MASK                 equ 0004h
PWM11INTE_PWM11OFIE_POSN                 equ 0003h
PWM11INTE_PWM11OFIE_POSITION             equ 0003h
PWM11INTE_PWM11OFIE_SIZE                 equ 0001h
PWM11INTE_PWM11OFIE_LENGTH               equ 0001h
PWM11INTE_PWM11OFIE_MASK                 equ 0008h

// Register: PWM11INTF
#define PWM11INTF PWM11INTF
PWM11INTF                                equ 0DBDh
// bitfield definitions
PWM11INTF_PRIF_POSN                      equ 0000h
PWM11INTF_PRIF_POSITION                  equ 0000h
PWM11INTF_PRIF_SIZE                      equ 0001h
PWM11INTF_PRIF_LENGTH                    equ 0001h
PWM11INTF_PRIF_MASK                      equ 0001h
PWM11INTF_DCIF_POSN                      equ 0001h
PWM11INTF_DCIF_POSITION                  equ 0001h
PWM11INTF_DCIF_SIZE                      equ 0001h
PWM11INTF_DCIF_LENGTH                    equ 0001h
PWM11INTF_DCIF_MASK                      equ 0002h
PWM11INTF_PHIF_POSN                      equ 0002h
PWM11INTF_PHIF_POSITION                  equ 0002h
PWM11INTF_PHIF_SIZE                      equ 0001h
PWM11INTF_PHIF_LENGTH                    equ 0001h
PWM11INTF_PHIF_MASK                      equ 0004h
PWM11INTF_OFIF_POSN                      equ 0003h
PWM11INTF_OFIF_POSITION                  equ 0003h
PWM11INTF_OFIF_SIZE                      equ 0001h
PWM11INTF_OFIF_LENGTH                    equ 0001h
PWM11INTF_OFIF_MASK                      equ 0008h
PWM11INTF_PWM11PRIF_POSN                 equ 0000h
PWM11INTF_PWM11PRIF_POSITION             equ 0000h
PWM11INTF_PWM11PRIF_SIZE                 equ 0001h
PWM11INTF_PWM11PRIF_LENGTH               equ 0001h
PWM11INTF_PWM11PRIF_MASK                 equ 0001h
PWM11INTF_PWM11DCIF_POSN                 equ 0001h
PWM11INTF_PWM11DCIF_POSITION             equ 0001h
PWM11INTF_PWM11DCIF_SIZE                 equ 0001h
PWM11INTF_PWM11DCIF_LENGTH               equ 0001h
PWM11INTF_PWM11DCIF_MASK                 equ 0002h
PWM11INTF_PWM11PHIF_POSN                 equ 0002h
PWM11INTF_PWM11PHIF_POSITION             equ 0002h
PWM11INTF_PWM11PHIF_SIZE                 equ 0001h
PWM11INTF_PWM11PHIF_LENGTH               equ 0001h
PWM11INTF_PWM11PHIF_MASK                 equ 0004h
PWM11INTF_PWM11OFIF_POSN                 equ 0003h
PWM11INTF_PWM11OFIF_POSITION             equ 0003h
PWM11INTF_PWM11OFIF_SIZE                 equ 0001h
PWM11INTF_PWM11OFIF_LENGTH               equ 0001h
PWM11INTF_PWM11OFIF_MASK                 equ 0008h

// Register: PWM11CLKCON
#define PWM11CLKCON PWM11CLKCON
PWM11CLKCON                              equ 0DBEh
// bitfield definitions
PWM11CLKCON_CS_POSN                      equ 0000h
PWM11CLKCON_CS_POSITION                  equ 0000h
PWM11CLKCON_CS_SIZE                      equ 0002h
PWM11CLKCON_CS_LENGTH                    equ 0002h
PWM11CLKCON_CS_MASK                      equ 0003h
PWM11CLKCON_PS_POSN                      equ 0004h
PWM11CLKCON_PS_POSITION                  equ 0004h
PWM11CLKCON_PS_SIZE                      equ 0003h
PWM11CLKCON_PS_LENGTH                    equ 0003h
PWM11CLKCON_PS_MASK                      equ 0070h
PWM11CLKCON_PWM11CS0_POSN                equ 0000h
PWM11CLKCON_PWM11CS0_POSITION            equ 0000h
PWM11CLKCON_PWM11CS0_SIZE                equ 0001h
PWM11CLKCON_PWM11CS0_LENGTH              equ 0001h
PWM11CLKCON_PWM11CS0_MASK                equ 0001h
PWM11CLKCON_PWM11CS1_POSN                equ 0001h
PWM11CLKCON_PWM11CS1_POSITION            equ 0001h
PWM11CLKCON_PWM11CS1_SIZE                equ 0001h
PWM11CLKCON_PWM11CS1_LENGTH              equ 0001h
PWM11CLKCON_PWM11CS1_MASK                equ 0002h
PWM11CLKCON_PWM11CS2_POSN                equ 0002h
PWM11CLKCON_PWM11CS2_POSITION            equ 0002h
PWM11CLKCON_PWM11CS2_SIZE                equ 0001h
PWM11CLKCON_PWM11CS2_LENGTH              equ 0001h
PWM11CLKCON_PWM11CS2_MASK                equ 0004h
PWM11CLKCON_PWM11PS0_POSN                equ 0004h
PWM11CLKCON_PWM11PS0_POSITION            equ 0004h
PWM11CLKCON_PWM11PS0_SIZE                equ 0001h
PWM11CLKCON_PWM11PS0_LENGTH              equ 0001h
PWM11CLKCON_PWM11PS0_MASK                equ 0010h
PWM11CLKCON_PWM11PS1_POSN                equ 0005h
PWM11CLKCON_PWM11PS1_POSITION            equ 0005h
PWM11CLKCON_PWM11PS1_SIZE                equ 0001h
PWM11CLKCON_PWM11PS1_LENGTH              equ 0001h
PWM11CLKCON_PWM11PS1_MASK                equ 0020h
PWM11CLKCON_PWM11PS2_POSN                equ 0006h
PWM11CLKCON_PWM11PS2_POSITION            equ 0006h
PWM11CLKCON_PWM11PS2_SIZE                equ 0001h
PWM11CLKCON_PWM11PS2_LENGTH              equ 0001h
PWM11CLKCON_PWM11PS2_MASK                equ 0040h
PWM11CLKCON_PWM11CS_POSN                 equ 0000h
PWM11CLKCON_PWM11CS_POSITION             equ 0000h
PWM11CLKCON_PWM11CS_SIZE                 equ 0003h
PWM11CLKCON_PWM11CS_LENGTH               equ 0003h
PWM11CLKCON_PWM11CS_MASK                 equ 0007h
PWM11CLKCON_PWM11PS_POSN                 equ 0004h
PWM11CLKCON_PWM11PS_POSITION             equ 0004h
PWM11CLKCON_PWM11PS_SIZE                 equ 0003h
PWM11CLKCON_PWM11PS_LENGTH               equ 0003h
PWM11CLKCON_PWM11PS_MASK                 equ 0070h
PWM11CLKCON_CS0_POSN                     equ 0000h
PWM11CLKCON_CS0_POSITION                 equ 0000h
PWM11CLKCON_CS0_SIZE                     equ 0001h
PWM11CLKCON_CS0_LENGTH                   equ 0001h
PWM11CLKCON_CS0_MASK                     equ 0001h
PWM11CLKCON_CS1_POSN                     equ 0001h
PWM11CLKCON_CS1_POSITION                 equ 0001h
PWM11CLKCON_CS1_SIZE                     equ 0001h
PWM11CLKCON_CS1_LENGTH                   equ 0001h
PWM11CLKCON_CS1_MASK                     equ 0002h
PWM11CLKCON_CS2_POSN                     equ 0002h
PWM11CLKCON_CS2_POSITION                 equ 0002h
PWM11CLKCON_CS2_SIZE                     equ 0001h
PWM11CLKCON_CS2_LENGTH                   equ 0001h
PWM11CLKCON_CS2_MASK                     equ 0004h
PWM11CLKCON_PS0_POSN                     equ 0004h
PWM11CLKCON_PS0_POSITION                 equ 0004h
PWM11CLKCON_PS0_SIZE                     equ 0001h
PWM11CLKCON_PS0_LENGTH                   equ 0001h
PWM11CLKCON_PS0_MASK                     equ 0010h
PWM11CLKCON_PS1_POSN                     equ 0005h
PWM11CLKCON_PS1_POSITION                 equ 0005h
PWM11CLKCON_PS1_SIZE                     equ 0001h
PWM11CLKCON_PS1_LENGTH                   equ 0001h
PWM11CLKCON_PS1_MASK                     equ 0020h
PWM11CLKCON_PS2_POSN                     equ 0006h
PWM11CLKCON_PS2_POSITION                 equ 0006h
PWM11CLKCON_PS2_SIZE                     equ 0001h
PWM11CLKCON_PS2_LENGTH                   equ 0001h
PWM11CLKCON_PS2_MASK                     equ 0040h

// Register: PWM11LDCON
#define PWM11LDCON PWM11LDCON
PWM11LDCON                               equ 0DBFh
// bitfield definitions
PWM11LDCON_LDS_POSN                      equ 0000h
PWM11LDCON_LDS_POSITION                  equ 0000h
PWM11LDCON_LDS_SIZE                      equ 0002h
PWM11LDCON_LDS_LENGTH                    equ 0002h
PWM11LDCON_LDS_MASK                      equ 0003h
PWM11LDCON_LDT_POSN                      equ 0006h
PWM11LDCON_LDT_POSITION                  equ 0006h
PWM11LDCON_LDT_SIZE                      equ 0001h
PWM11LDCON_LDT_LENGTH                    equ 0001h
PWM11LDCON_LDT_MASK                      equ 0040h
PWM11LDCON_LDA_POSN                      equ 0007h
PWM11LDCON_LDA_POSITION                  equ 0007h
PWM11LDCON_LDA_SIZE                      equ 0001h
PWM11LDCON_LDA_LENGTH                    equ 0001h
PWM11LDCON_LDA_MASK                      equ 0080h
PWM11LDCON_PWM11LDS0_POSN                equ 0000h
PWM11LDCON_PWM11LDS0_POSITION            equ 0000h
PWM11LDCON_PWM11LDS0_SIZE                equ 0001h
PWM11LDCON_PWM11LDS0_LENGTH              equ 0001h
PWM11LDCON_PWM11LDS0_MASK                equ 0001h
PWM11LDCON_PWM11LDS1_POSN                equ 0001h
PWM11LDCON_PWM11LDS1_POSITION            equ 0001h
PWM11LDCON_PWM11LDS1_SIZE                equ 0001h
PWM11LDCON_PWM11LDS1_LENGTH              equ 0001h
PWM11LDCON_PWM11LDS1_MASK                equ 0002h
PWM11LDCON_PWM11LDS_POSN                 equ 0000h
PWM11LDCON_PWM11LDS_POSITION             equ 0000h
PWM11LDCON_PWM11LDS_SIZE                 equ 0002h
PWM11LDCON_PWM11LDS_LENGTH               equ 0002h
PWM11LDCON_PWM11LDS_MASK                 equ 0003h
PWM11LDCON_PWM11LDM_POSN                 equ 0006h
PWM11LDCON_PWM11LDM_POSITION             equ 0006h
PWM11LDCON_PWM11LDM_SIZE                 equ 0001h
PWM11LDCON_PWM11LDM_LENGTH               equ 0001h
PWM11LDCON_PWM11LDM_MASK                 equ 0040h
PWM11LDCON_PWM11LD_POSN                  equ 0007h
PWM11LDCON_PWM11LD_POSITION              equ 0007h
PWM11LDCON_PWM11LD_SIZE                  equ 0001h
PWM11LDCON_PWM11LD_LENGTH                equ 0001h
PWM11LDCON_PWM11LD_MASK                  equ 0080h
PWM11LDCON_LDS0_POSN                     equ 0000h
PWM11LDCON_LDS0_POSITION                 equ 0000h
PWM11LDCON_LDS0_SIZE                     equ 0001h
PWM11LDCON_LDS0_LENGTH                   equ 0001h
PWM11LDCON_LDS0_MASK                     equ 0001h
PWM11LDCON_LDS1_POSN                     equ 0001h
PWM11LDCON_LDS1_POSITION                 equ 0001h
PWM11LDCON_LDS1_SIZE                     equ 0001h
PWM11LDCON_LDS1_LENGTH                   equ 0001h
PWM11LDCON_LDS1_MASK                     equ 0002h

