GopalSaraf/Practicals/PSDL/include/proc/pic16f1776.inc
// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 0E15h
// bitfield definitions
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0006h
T2INPPS_T2INPPS_LENGTH                   equ 0006h
T2INPPS_T2INPPS_MASK                     equ 003Fh

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 0E16h
// bitfield definitions
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0006h
T4INPPS_T4INPPS_LENGTH                   equ 0006h
T4INPPS_T4INPPS_MASK                     equ 003Fh

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 0E17h
// bitfield definitions
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0006h
T6INPPS_T6INPPS_LENGTH                   equ 0006h
T6INPPS_T6INPPS_MASK                     equ 003Fh

// Register: T8INPPS
#define T8INPPS T8INPPS
T8INPPS                                  equ 0E18h
// bitfield definitions
T8INPPS_T8INPPS_POSN                     equ 0000h
T8INPPS_T8INPPS_POSITION                 equ 0000h
T8INPPS_T8INPPS_SIZE                     equ 0006h
T8INPPS_T8INPPS_LENGTH                   equ 0006h
T8INPPS_T8INPPS_MASK                     equ 003Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0E19h
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0006h
CCP1PPS_CCP1PPS_LENGTH                   equ 0006h
CCP1PPS_CCP1PPS_MASK                     equ 003Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0E1Ah
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0006h
CCP2PPS_CCP2PPS_LENGTH                   equ 0006h
CCP2PPS_CCP2PPS_MASK                     equ 003Fh

// Register: CCP7PPS
#define CCP7PPS CCP7PPS
CCP7PPS                                  equ 0E1Bh
// bitfield definitions
CCP7PPS_CCP7PPS_POSN                     equ 0000h
CCP7PPS_CCP7PPS_POSITION                 equ 0000h
CCP7PPS_CCP7PPS_SIZE                     equ 0006h
CCP7PPS_CCP7PPS_LENGTH                   equ 0006h
CCP7PPS_CCP7PPS_MASK                     equ 003Fh

// Register: COG1INPPS
#define COG1INPPS COG1INPPS
COG1INPPS                                equ 0E1Dh
// bitfield definitions
COG1INPPS_COG1INPPS_POSN                 equ 0000h
COG1INPPS_COG1INPPS_POSITION             equ 0000h
COG1INPPS_COG1INPPS_SIZE                 equ 0006h
COG1INPPS_COG1INPPS_LENGTH               equ 0006h
COG1INPPS_COG1INPPS_MASK                 equ 003Fh

// Register: COG2INPPS
#define COG2INPPS COG2INPPS
COG2INPPS                                equ 0E1Eh
// bitfield definitions
COG2INPPS_COG2INPPS_POSN                 equ 0000h
COG2INPPS_COG2INPPS_POSITION             equ 0000h
COG2INPPS_COG2INPPS_SIZE                 equ 0006h
COG2INPPS_COG2INPPS_LENGTH               equ 0006h
COG2INPPS_COG2INPPS_MASK                 equ 003Fh

// Register: COG3INPPS
#define COG3INPPS COG3INPPS
COG3INPPS                                equ 0E1Fh
// bitfield definitions
COG3INPPS_COG3INPPS_POSN                 equ 0000h
COG3INPPS_COG3INPPS_POSITION             equ 0000h
COG3INPPS_COG3INPPS_SIZE                 equ 0006h
COG3INPPS_COG3INPPS_LENGTH               equ 0006h
COG3INPPS_COG3INPPS_MASK                 equ 003Fh

// Register: MD1CLPPS
#define MD1CLPPS MD1CLPPS
MD1CLPPS                                 equ 0E21h
// bitfield definitions
MD1CLPPS_MD1CLPPS_POSN                   equ 0000h
MD1CLPPS_MD1CLPPS_POSITION               equ 0000h
MD1CLPPS_MD1CLPPS_SIZE                   equ 0006h
MD1CLPPS_MD1CLPPS_LENGTH                 equ 0006h
MD1CLPPS_MD1CLPPS_MASK                   equ 003Fh

// Register: MD1CHPPS
#define MD1CHPPS MD1CHPPS
MD1CHPPS                                 equ 0E22h
// bitfield definitions
MD1CHPPS_MD1CHPPS_POSN                   equ 0000h
MD1CHPPS_MD1CHPPS_POSITION               equ 0000h
MD1CHPPS_MD1CHPPS_SIZE                   equ 0006h
MD1CHPPS_MD1CHPPS_LENGTH                 equ 0006h
MD1CHPPS_MD1CHPPS_MASK                   equ 003Fh

// Register: MD1MODPPS
#define MD1MODPPS MD1MODPPS
MD1MODPPS                                equ 0E23h
// bitfield definitions
MD1MODPPS_MD1MODPPS_POSN                 equ 0000h
MD1MODPPS_MD1MODPPS_POSITION             equ 0000h
MD1MODPPS_MD1MODPPS_SIZE                 equ 0006h
MD1MODPPS_MD1MODPPS_LENGTH               equ 0006h
MD1MODPPS_MD1MODPPS_MASK                 equ 003Fh

// Register: MD2CLPPS
#define MD2CLPPS MD2CLPPS
MD2CLPPS                                 equ 0E24h
// bitfield definitions
MD2CLPPS_MD2CLPPS_POSN                   equ 0000h
MD2CLPPS_MD2CLPPS_POSITION               equ 0000h
MD2CLPPS_MD2CLPPS_SIZE                   equ 0006h
MD2CLPPS_MD2CLPPS_LENGTH                 equ 0006h
MD2CLPPS_MD2CLPPS_MASK                   equ 003Fh

// Register: MD2CHPPS
#define MD2CHPPS MD2CHPPS
MD2CHPPS                                 equ 0E25h
// bitfield definitions
MD2CHPPS_MD2CHPPS_POSN                   equ 0000h
MD2CHPPS_MD2CHPPS_POSITION               equ 0000h
MD2CHPPS_MD2CHPPS_SIZE                   equ 0006h
MD2CHPPS_MD2CHPPS_LENGTH                 equ 0006h
MD2CHPPS_MD2CHPPS_MASK                   equ 003Fh

// Register: MD2MODPPS
#define MD2MODPPS MD2MODPPS
MD2MODPPS                                equ 0E26h
// bitfield definitions
MD2MODPPS_MD2MODPPS_POSN                 equ 0000h
MD2MODPPS_MD2MODPPS_POSITION             equ 0000h
MD2MODPPS_MD2MODPPS_SIZE                 equ 0006h
MD2MODPPS_MD2MODPPS_LENGTH               equ 0006h
MD2MODPPS_MD2MODPPS_MASK                 equ 003Fh

// Register: MD3CLPPS
#define MD3CLPPS MD3CLPPS
MD3CLPPS                                 equ 0E27h
// bitfield definitions
MD3CLPPS_MD3CLPPS_POSN                   equ 0000h
MD3CLPPS_MD3CLPPS_POSITION               equ 0000h
MD3CLPPS_MD3CLPPS_SIZE                   equ 0006h
MD3CLPPS_MD3CLPPS_LENGTH                 equ 0006h
MD3CLPPS_MD3CLPPS_MASK                   equ 003Fh

