GopalSaraf/Practicals/PSDL/include/proc/pic16f1776.inc
#define LC3G2D4T                         BANKMASK(CLC3GLS1), 7
#define LC3G2POL                         BANKMASK(CLC3POL), 1
#define LC3G3D1N                         BANKMASK(CLC3GLS2), 0
#define LC3G3D1T                         BANKMASK(CLC3GLS2), 1
#define LC3G3D2N                         BANKMASK(CLC3GLS2), 2
#define LC3G3D2T                         BANKMASK(CLC3GLS2), 3
#define LC3G3D3N                         BANKMASK(CLC3GLS2), 4
#define LC3G3D3T                         BANKMASK(CLC3GLS2), 5
#define LC3G3D4N                         BANKMASK(CLC3GLS2), 6
#define LC3G3D4T                         BANKMASK(CLC3GLS2), 7
#define LC3G3POL                         BANKMASK(CLC3POL), 2
#define LC3G4D1N                         BANKMASK(CLC3GLS3), 0
#define LC3G4D1T                         BANKMASK(CLC3GLS3), 1
#define LC3G4D2N                         BANKMASK(CLC3GLS3), 2
#define LC3G4D2T                         BANKMASK(CLC3GLS3), 3
#define LC3G4D3N                         BANKMASK(CLC3GLS3), 4
#define LC3G4D3T                         BANKMASK(CLC3GLS3), 5
#define LC3G4D4N                         BANKMASK(CLC3GLS3), 6
#define LC3G4D4T                         BANKMASK(CLC3GLS3), 7
#define LC3G4POL                         BANKMASK(CLC3POL), 3
#define LC3INTN                          BANKMASK(CLC3CON), 3
#define LC3INTP                          BANKMASK(CLC3CON), 4
#define LC3MODE0                         BANKMASK(CLC3CON), 0
#define LC3MODE1                         BANKMASK(CLC3CON), 1
#define LC3MODE2                         BANKMASK(CLC3CON), 2
#define LC3OUT                           BANKMASK(CLC3CON), 5
#define LC3POL                           BANKMASK(CLC3POL), 7
#define LC4D1S0                          BANKMASK(CLC4SEL0), 0
#define LC4D1S1                          BANKMASK(CLC4SEL0), 1
#define LC4D1S2                          BANKMASK(CLC4SEL0), 2
#define LC4D1S3                          BANKMASK(CLC4SEL0), 3
#define LC4D1S4                          BANKMASK(CLC4SEL0), 4
#define LC4D1S5                          BANKMASK(CLC4SEL0), 5
#define LC4D2S0                          BANKMASK(CLC4SEL1), 0
#define LC4D2S1                          BANKMASK(CLC4SEL1), 1
#define LC4D2S2                          BANKMASK(CLC4SEL1), 2
#define LC4D2S3                          BANKMASK(CLC4SEL1), 3
#define LC4D2S4                          BANKMASK(CLC4SEL1), 4
#define LC4D2S5                          BANKMASK(CLC4SEL1), 5
#define LC4D3S0                          BANKMASK(CLC4SEL2), 0
#define LC4D3S1                          BANKMASK(CLC4SEL2), 1
#define LC4D3S2                          BANKMASK(CLC4SEL2), 2
#define LC4D3S3                          BANKMASK(CLC4SEL2), 3
#define LC4D3S4                          BANKMASK(CLC4SEL2), 4
#define LC4D3S5                          BANKMASK(CLC4SEL2), 5
#define LC4D4S0                          BANKMASK(CLC4SEL3), 0
#define LC4D4S1                          BANKMASK(CLC4SEL3), 1
#define LC4D4S2                          BANKMASK(CLC4SEL3), 2
#define LC4D4S3                          BANKMASK(CLC4SEL3), 3
#define LC4D4S4                          BANKMASK(CLC4SEL3), 4
#define LC4D4S5                          BANKMASK(CLC4SEL3), 5
#define LC4EN                            BANKMASK(CLC4CON), 7
#define LC4G1D1N                         BANKMASK(CLC4GLS0), 0
#define LC4G1D1T                         BANKMASK(CLC4GLS0), 1
#define LC4G1D2N                         BANKMASK(CLC4GLS0), 2
#define LC4G1D2T                         BANKMASK(CLC4GLS0), 3
#define LC4G1D3N                         BANKMASK(CLC4GLS0), 4
#define LC4G1D3T                         BANKMASK(CLC4GLS0), 5
#define LC4G1D4N                         BANKMASK(CLC4GLS0), 6
#define LC4G1D4T                         BANKMASK(CLC4GLS0), 7
#define LC4G1POL                         BANKMASK(CLC4POL), 0
#define LC4G2D1N                         BANKMASK(CLC4GLS1), 0
#define LC4G2D1T                         BANKMASK(CLC4GLS1), 1
#define LC4G2D2N                         BANKMASK(CLC4GLS1), 2
#define LC4G2D2T                         BANKMASK(CLC4GLS1), 3
#define LC4G2D3N                         BANKMASK(CLC4GLS1), 4
#define LC4G2D3T                         BANKMASK(CLC4GLS1), 5
#define LC4G2D4N                         BANKMASK(CLC4GLS1), 6
#define LC4G2D4T                         BANKMASK(CLC4GLS1), 7
#define LC4G2POL                         BANKMASK(CLC4POL), 1
#define LC4G3D1N                         BANKMASK(CLC4GLS2), 0
#define LC4G3D1T                         BANKMASK(CLC4GLS2), 1
#define LC4G3D2N                         BANKMASK(CLC4GLS2), 2
#define LC4G3D2T                         BANKMASK(CLC4GLS2), 3
#define LC4G3D3N                         BANKMASK(CLC4GLS2), 4
#define LC4G3D3T                         BANKMASK(CLC4GLS2), 5
#define LC4G3D4N                         BANKMASK(CLC4GLS2), 6
#define LC4G3D4T                         BANKMASK(CLC4GLS2), 7
#define LC4G3POL                         BANKMASK(CLC4POL), 2
#define LC4G4D1N                         BANKMASK(CLC4GLS3), 0
#define LC4G4D1T                         BANKMASK(CLC4GLS3), 1
#define LC4G4D2N                         BANKMASK(CLC4GLS3), 2
#define LC4G4D2T                         BANKMASK(CLC4GLS3), 3
#define LC4G4D3N                         BANKMASK(CLC4GLS3), 4
#define LC4G4D3T                         BANKMASK(CLC4GLS3), 5
#define LC4G4D4N                         BANKMASK(CLC4GLS3), 6
#define LC4G4D4T                         BANKMASK(CLC4GLS3), 7
#define LC4G4POL                         BANKMASK(CLC4POL), 3
#define LC4INTN                          BANKMASK(CLC4CON), 3
#define LC4INTP                          BANKMASK(CLC4CON), 4
#define LC4MODE0                         BANKMASK(CLC4CON), 0
#define LC4MODE1                         BANKMASK(CLC4CON), 1
#define LC4MODE2                         BANKMASK(CLC4CON), 2
#define LC4OUT                           BANKMASK(CLC4CON), 5
#define LC4POL                           BANKMASK(CLC4POL), 7
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LWLO                             BANKMASK(PMCON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MC3OUT                           BANKMASK(CMOUT), 2
#define MC4OUT                           BANKMASK(CMOUT), 3
#define MC5OUT                           BANKMASK(CMOUT), 4
#define MC6OUT                           BANKMASK(CMOUT), 5
#define MCLC1OUT                         BANKMASK(CLCDATA), 0
#define MCLC2OUT                         BANKMASK(CLCDATA), 1
#define MCLC3OUT                         BANKMASK(CLCDATA), 2
#define MD1BIT                           BANKMASK(MD1CON0), 0
#define MD1CH0                           BANKMASK(MD1CARH), 0
#define MD1CH1                           BANKMASK(MD1CARH), 1
#define MD1CH2                           BANKMASK(MD1CARH), 2
#define MD1CH3                           BANKMASK(MD1CARH), 3
#define MD1CH4                           BANKMASK(MD1CARH), 4
#define MD1CHPOL                         BANKMASK(MD1CON1), 5
#define MD1CHSYNC                        BANKMASK(MD1CON1), 4
#define MD1CL0                           BANKMASK(MD1CARL), 0
#define MD1CL1                           BANKMASK(MD1CARL), 1
#define MD1CL2                           BANKMASK(MD1CARL), 2
#define MD1CL3                           BANKMASK(MD1CARL), 3
#define MD1CL4                           BANKMASK(MD1CARL), 4
#define MD1CLPOL                         BANKMASK(MD1CON1), 1
#define MD1CLSYNC                        BANKMASK(MD1CON1), 0
#define MD1EN                            BANKMASK(MD1CON0), 7
#define MD1MS0                           BANKMASK(MD1SRC), 0
#define MD1MS1                           BANKMASK(MD1SRC), 1
#define MD1MS2                           BANKMASK(MD1SRC), 2
#define MD1MS3                           BANKMASK(MD1SRC), 3
#define MD1MS4                           BANKMASK(MD1SRC), 4
#define MD1OPOL                          BANKMASK(MD1CON0), 4
#define MD1OUT                           BANKMASK(MD1CON0), 5
#define MD2BIT                           BANKMASK(MD2CON0), 0
#define MD2CH0                           BANKMASK(MD2CARH), 0
#define MD2CH1                           BANKMASK(MD2CARH), 1
#define MD2CH2                           BANKMASK(MD2CARH), 2
#define MD2CH3                           BANKMASK(MD2CARH), 3
#define MD2CH4                           BANKMASK(MD2CARH), 4
#define MD2CHPOL                         BANKMASK(MD2CON1), 5
#define MD2CHSYNC                        BANKMASK(MD2CON1), 4
#define MD2CL0                           BANKMASK(MD2CARL), 0
#define MD2CL1                           BANKMASK(MD2CARL), 1
#define MD2CL2                           BANKMASK(MD2CARL), 2
#define MD2CL3                           BANKMASK(MD2CARL), 3
#define MD2CL4                           BANKMASK(MD2CARL), 4
#define MD2CLPOL                         BANKMASK(MD2CON1), 1
#define MD2CLSYNC                        BANKMASK(MD2CON1), 0
#define MD2EN                            BANKMASK(MD2CON0), 7
#define MD2MS0                           BANKMASK(MD2SRC), 0
#define MD2MS1                           BANKMASK(MD2SRC), 1
#define MD2MS2                           BANKMASK(MD2SRC), 2
#define MD2MS3                           BANKMASK(MD2SRC), 3
#define MD2MS4                           BANKMASK(MD2SRC), 4
#define MD2OPOL                          BANKMASK(MD2CON0), 4
#define MD2OUT                           BANKMASK(MD2CON0), 5
#define MD3BIT                           BANKMASK(MD3CON0), 0
#define MD3CH0                           BANKMASK(MD3CARH), 0
#define MD3CH1                           BANKMASK(MD3CARH), 1
#define MD3CH2                           BANKMASK(MD3CARH), 2
#define MD3CH3                           BANKMASK(MD3CARH), 3
#define MD3CH4                           BANKMASK(MD3CARH), 4
#define MD3CHPOL                         BANKMASK(MD3CON1), 5
#define MD3CHSYNC                        BANKMASK(MD3CON1), 4
#define MD3CL0                           BANKMASK(MD3CARL), 0
#define MD3CL1                           BANKMASK(MD3CARL), 1
#define MD3CL2                           BANKMASK(MD3CARL), 2
#define MD3CL3                           BANKMASK(MD3CARL), 3
#define MD3CL4                           BANKMASK(MD3CARL), 4
#define MD3CLPOL                         BANKMASK(MD3CON1), 1
#define MD3CLSYNC                        BANKMASK(MD3CON1), 0
#define MD3EN                            BANKMASK(MD3CON0), 7
#define MD3MS0                           BANKMASK(MD3SRC), 0
#define MD3MS1                           BANKMASK(MD3SRC), 1
#define MD3MS2                           BANKMASK(MD3SRC), 2
#define MD3MS3                           BANKMASK(MD3SRC), 3
#define MD3MS4                           BANKMASK(MD3SRC), 4
#define MD3OPOL                          BANKMASK(MD3CON0), 4
#define MD3OUT                           BANKMASK(MD3CON0), 5
#define MFIOFR                           BANKMASK(OSCSTAT), 2
#define MLC4OUT                          BANKMASK(CLCDATA), 3
#define MPWM11EN                         BANKMASK(PWMEN), 2
#define MPWM11LD                         BANKMASK(PWMLD), 2
#define MPWM11OUT                        BANKMASK(PWMOUT), 2
#define MPWM5EN                          BANKMASK(PWMEN), 0
#define MPWM5LD                          BANKMASK(PWMLD), 0
#define MPWM5OUT                         BANKMASK(PWMOUT), 0
#define MPWM6EN                          BANKMASK(PWMEN), 1
#define MPWM6LD                          BANKMASK(PWMLD), 1
#define MPWM6OUT                         BANKMASK(PWMOUT), 1
#define MSK0                             BANKMASK(SSP1MSK), 0
#define MSK1                             BANKMASK(SSP1MSK), 1
#define MSK2                             BANKMASK(SSP1MSK), 2
#define MSK3                             BANKMASK(SSP1MSK), 3
#define MSK4                             BANKMASK(SSP1MSK), 4
#define MSK5                             BANKMASK(SSP1MSK), 5
#define MSK6                             BANKMASK(SSP1MSK), 6
#define MSK7                             BANKMASK(SSP1MSK), 7
#define ODA0                             BANKMASK(ODCONA), 0
#define ODA1                             BANKMASK(ODCONA), 1
#define ODA2                             BANKMASK(ODCONA), 2
#define ODA3                             BANKMASK(ODCONA), 3
#define ODA4                             BANKMASK(ODCONA), 4
#define ODA5                             BANKMASK(ODCONA), 5
#define ODA6                             BANKMASK(ODCONA), 6
#define ODA7                             BANKMASK(ODCONA), 7
#define ODB0                             BANKMASK(ODCONB), 0
#define ODB1                             BANKMASK(ODCONB), 1
#define ODB2                             BANKMASK(ODCONB), 2
#define ODB3                             BANKMASK(ODCONB), 3
#define ODB4                             BANKMASK(ODCONB), 4
#define ODB5                             BANKMASK(ODCONB), 5
#define ODB6                             BANKMASK(ODCONB), 6
#define ODB7                             BANKMASK(ODCONB), 7
#define ODC0                             BANKMASK(ODCONC), 0
#define ODC1                             BANKMASK(ODCONC), 1
#define ODC2                             BANKMASK(ODCONC), 2
#define ODC3                             BANKMASK(ODCONC), 3
#define ODC4                             BANKMASK(ODCONC), 4
#define ODC5                             BANKMASK(ODCONC), 5
#define ODC6                             BANKMASK(ODCONC), 6
#define ODC7                             BANKMASK(ODCONC), 7
#define OERR                             BANKMASK(RC1STA), 1
#define OPA1EN                           BANKMASK(OPA1CON), 7
#define OPA1ORM0                         BANKMASK(OPA1CON), 0
#define OPA1ORM1                         BANKMASK(OPA1CON), 1
#define OPA1ORPOL                        BANKMASK(OPA1CON), 2
#define OPA1UG                           BANKMASK(OPA1CON), 4
#define OPA2EN                           BANKMASK(OPA2CON), 7
#define OPA2ORM0                         BANKMASK(OPA2CON), 0
#define OPA2ORM1                         BANKMASK(OPA2CON), 1
#define OPA2ORPOL                        BANKMASK(OPA2CON), 2
#define OPA2UG                           BANKMASK(OPA2CON), 4
#define OPA3EN                           BANKMASK(OPA3CON), 7
#define OPA3ORM0                         BANKMASK(OPA3CON), 0
#define OPA3ORM1                         BANKMASK(OPA3CON), 1
#define OPA3ORPOL                        BANKMASK(OPA3CON), 2
#define OPA3SP                           BANKMASK(OPA3CON), 6
#define OPA3UG                           BANKMASK(OPA3CON), 4
#define OSFIE                            BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
#define OSTS                             BANKMASK(OSCSTAT), 5
#define P3TSEL0                          BANKMASK(CCPTMRS2), 0
#define P3TSEL1                          BANKMASK(CCPTMRS2), 1
#define P4TSEL0                          BANKMASK(CCPTMRS2), 2
#define P4TSEL1                          BANKMASK(CCPTMRS2), 3
#define P9TSEL0                          BANKMASK(CCPTMRS2), 4
#define P9TSEL1                          BANKMASK(CCPTMRS2), 5
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PSA                              BANKMASK(OPTION_REG), 3
#define PWM11CS0                         BANKMASK(PWM11CLKCON), 0
#define PWM11CS1                         BANKMASK(PWM11CLKCON), 1
#define PWM11CS2                         BANKMASK(PWM11CLKCON), 2
#define PWM11DCH0                        BANKMASK(PWM11DCH), 0
#define PWM11DCH1                        BANKMASK(PWM11DCH), 1
#define PWM11DCH2                        BANKMASK(PWM11DCH), 2
#define PWM11DCH3                        BANKMASK(PWM11DCH), 3
#define PWM11DCH4                        BANKMASK(PWM11DCH), 4
#define PWM11DCH5                        BANKMASK(PWM11DCH), 5
#define PWM11DCH6                        BANKMASK(PWM11DCH), 6
#define PWM11DCH7                        BANKMASK(PWM11DCH), 7
#define PWM11DCIE                        BANKMASK(PWM11INTE), 1
#define PWM11DCIF                        BANKMASK(PWM11INTF), 1
#define PWM11DCL0                        BANKMASK(PWM11DCL), 0
#define PWM11DCL1                        BANKMASK(PWM11DCL), 1
#define PWM11DCL2                        BANKMASK(PWM11DCL), 2
#define PWM11DCL3                        BANKMASK(PWM11DCL), 3
#define PWM11DCL4                        BANKMASK(PWM11DCL), 4
#define PWM11DCL5                        BANKMASK(PWM11DCL), 5
#define PWM11DCL6                        BANKMASK(PWM11DCL), 6
#define PWM11DCL7                        BANKMASK(PWM11DCL), 7
#define PWM11EN                          BANKMASK(PWM11CON), 7
#define PWM11IE                          BANKMASK(PIE6), 2
#define PWM11IF                          BANKMASK(PIR6), 2
#define PWM11LD                          BANKMASK(PWM11LDCON), 7
#define PWM11LDM                         BANKMASK(PWM11LDCON), 6
#define PWM11LDS0                        BANKMASK(PWM11LDCON), 0
#define PWM11LDS1                        BANKMASK(PWM11LDCON), 1
#define PWM11MODE0                       BANKMASK(PWM11CON), 2
#define PWM11MODE1                       BANKMASK(PWM11CON), 3
#define PWM11OFH0                        BANKMASK(PWM11OFH), 0
#define PWM11OFH1                        BANKMASK(PWM11OFH), 1
#define PWM11OFH2                        BANKMASK(PWM11OFH), 2
#define PWM11OFH3                        BANKMASK(PWM11OFH), 3
#define PWM11OFH4                        BANKMASK(PWM11OFH), 4
#define PWM11OFH5                        BANKMASK(PWM11OFH), 5
#define PWM11OFH6                        BANKMASK(PWM11OFH), 6
#define PWM11OFH7                        BANKMASK(PWM11OFH), 7
#define PWM11OFIE                        BANKMASK(PWM11INTE), 3
#define PWM11OFIF                        BANKMASK(PWM11INTF), 3
#define PWM11OFL0                        BANKMASK(PWM11OFL), 0
#define PWM11OFL1                        BANKMASK(PWM11OFL), 1
#define PWM11OFL2                        BANKMASK(PWM11OFL), 2
#define PWM11OFL3                        BANKMASK(PWM11OFL), 3
#define PWM11OFL4                        BANKMASK(PWM11OFL), 4
#define PWM11OFL5                        BANKMASK(PWM11OFL), 5
#define PWM11OFL6                        BANKMASK(PWM11OFL), 6
#define PWM11OFL7                        BANKMASK(PWM11OFL), 7
#define PWM11OFM0                        BANKMASK(PWM11OFCON), 5
#define PWM11OFM1                        BANKMASK(PWM11OFCON), 6
#define PWM11OFMC                        BANKMASK(PWM11OFCON), 4
#define PWM11OFS0                        BANKMASK(PWM11OFCON), 0
#define PWM11OFS1                        BANKMASK(PWM11OFCON), 1
#define PWM11OUT                         BANKMASK(PWM11CON), 5
#define PWM11PHH0                        BANKMASK(PWM11PHH), 0
#define PWM11PHH1                        BANKMASK(PWM11PHH), 1
#define PWM11PHH2                        BANKMASK(PWM11PHH), 2
#define PWM11PHH3                        BANKMASK(PWM11PHH), 3
#define PWM11PHH4                        BANKMASK(PWM11PHH), 4
#define PWM11PHH5                        BANKMASK(PWM11PHH), 5
#define PWM11PHH6                        BANKMASK(PWM11PHH), 6
#define PWM11PHH7                        BANKMASK(PWM11PHH), 7
#define PWM11PHIE                        BANKMASK(PWM11INTE), 2
#define PWM11PHIF                        BANKMASK(PWM11INTF), 2
#define PWM11PHL0                        BANKMASK(PWM11PHL), 0
#define PWM11PHL1                        BANKMASK(PWM11PHL), 1
#define PWM11PHL2                        BANKMASK(PWM11PHL), 2
#define PWM11PHL3                        BANKMASK(PWM11PHL), 3
#define PWM11PHL4                        BANKMASK(PWM11PHL), 4
#define PWM11PHL5                        BANKMASK(PWM11PHL), 5
#define PWM11PHL6                        BANKMASK(PWM11PHL), 6
#define PWM11PHL7                        BANKMASK(PWM11PHL), 7
#define PWM11POL                         BANKMASK(PWM11CON), 4
#define PWM11PRH0                        BANKMASK(PWM11PRH), 0
#define PWM11PRH1                        BANKMASK(PWM11PRH), 1
#define PWM11PRH2                        BANKMASK(PWM11PRH), 2
#define PWM11PRH3                        BANKMASK(PWM11PRH), 3
#define PWM11PRH4                        BANKMASK(PWM11PRH), 4
#define PWM11PRH5                        BANKMASK(PWM11PRH), 5
#define PWM11PRH6                        BANKMASK(PWM11PRH), 6
#define PWM11PRH7                        BANKMASK(PWM11PRH), 7
#define PWM11PRIE                        BANKMASK(PWM11INTE), 0
#define PWM11PRIF                        BANKMASK(PWM11INTF), 0
#define PWM11PRL0                        BANKMASK(PWM11PRL), 0
#define PWM11PRL1                        BANKMASK(PWM11PRL), 1
#define PWM11PRL2                        BANKMASK(PWM11PRL), 2
#define PWM11PRL3                        BANKMASK(PWM11PRL), 3
#define PWM11PRL4                        BANKMASK(PWM11PRL), 4
#define PWM11PRL5                        BANKMASK(PWM11PRL), 5
#define PWM11PRL6                        BANKMASK(PWM11PRL), 6
#define PWM11PRL7                        BANKMASK(PWM11PRL), 7
#define PWM11PS0                         BANKMASK(PWM11CLKCON), 4
#define PWM11PS1                         BANKMASK(PWM11CLKCON), 5
#define PWM11PS2                         BANKMASK(PWM11CLKCON), 6
#define PWM11TMRH0                       BANKMASK(PWM11TMRH), 0
#define PWM11TMRH1                       BANKMASK(PWM11TMRH), 1
#define PWM11TMRH2                       BANKMASK(PWM11TMRH), 2
#define PWM11TMRH3                       BANKMASK(PWM11TMRH), 3
#define PWM11TMRH4                       BANKMASK(PWM11TMRH), 4
#define PWM11TMRH5                       BANKMASK(PWM11TMRH), 5
#define PWM11TMRH6                       BANKMASK(PWM11TMRH), 6
#define PWM11TMRH7                       BANKMASK(PWM11TMRH), 7
#define PWM11TMRL0                       BANKMASK(PWM11TMRL), 0
#define PWM11TMRL1                       BANKMASK(PWM11TMRL), 1
#define PWM11TMRL2                       BANKMASK(PWM11TMRL), 2
#define PWM11TMRL3                       BANKMASK(PWM11TMRL), 3
#define PWM11TMRL4                       BANKMASK(PWM11TMRL), 4
#define PWM11TMRL5                       BANKMASK(PWM11TMRL), 5
#define PWM11TMRL6                       BANKMASK(PWM11TMRL), 6
#define PWM11TMRL7                       BANKMASK(PWM11TMRL), 7
#define PWM3DC0                          BANKMASK(PWM3DCL), 6
#define PWM3DC1                          BANKMASK(PWM3DCL), 7
#define PWM3DC2                          BANKMASK(PWM3DCH), 0
#define PWM3DC3                          BANKMASK(PWM3DCH), 1
#define PWM3DC4                          BANKMASK(PWM3DCH), 2
#define PWM3DC5                          BANKMASK(PWM3DCH), 3
#define PWM3DC6                          BANKMASK(PWM3DCH), 4
#define PWM3DC7                          BANKMASK(PWM3DCH), 5
#define PWM3DC8                          BANKMASK(PWM3DCH), 6
#define PWM3DC9                          BANKMASK(PWM3DCH), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM4DC0                          BANKMASK(PWM4DCL), 6
#define PWM4DC1                          BANKMASK(PWM4DCL), 7
#define PWM4DC2                          BANKMASK(PWM4DCH), 0
#define PWM4DC3                          BANKMASK(PWM4DCH), 1
#define PWM4DC4                          BANKMASK(PWM4DCH), 2
#define PWM4DC5                          BANKMASK(PWM4DCH), 3
#define PWM4DC6                          BANKMASK(PWM4DCH), 4
#define PWM4DC7                          BANKMASK(PWM4DCH), 5
#define PWM4DC8                          BANKMASK(PWM4DCH), 6
#define PWM4DC9                          BANKMASK(PWM4DCH), 7
#define PWM4EN                           BANKMASK(PWM4CON), 7
